Extensions/АБ/Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Контрагенты</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УВМ_Клиент</Name>
					<Comment>Задача 326149</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_Конкурент</Name>
					<Comment>Задача 326149</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_Перевозчик</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_Подрядчик</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_Поставщик</Name>
					<Comment>Задача 326149</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_ПрочиеОтношения</Name>
					<Comment>Задача 326149</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_Хранитель_Арендодатель</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Extensions/АБ/Catalogs/Контрагенты/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
&После("ПриСозданииНаСервере")
Процедура АБ_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//++dar 13.11.25 (291567)
	СтруктураСвойствГруппы = Новый Структура;
	СтруктураСвойствГруппы.Вставить("ОтображатьЗаголовок", Ложь);
	
	УВМ_РаботаСФормами.НоваяГруппаОбычная(ЭтаФорма, "УВМ_ГруппаЗапрещенаРазрешенаОтгрузка", Элементы.ГруппаРеквизиты, , 3, , , СтруктураСвойствГруппы);
	
	СвойстваЭлементовФормы = УВМ_КлиентСервер.СвойстваЗапрещенаРазрешенаОтгрузкаКонтрагента(Объект.Ссылка);
	
	СтруктураСвойствКнопки = Новый Структура;
	СтруктураСвойствКнопки.Вставить("ЦветТекста", СвойстваЭлементовФормы.ЦветТекста);
	
	УВМ_РаботаСФормами.НоваяДекорацияКартинка(ЭтаФорма, "УВМ_ДекорацияКартинкаЗапрещенаРазрешенаОтгрузка", Элементы.УВМ_ГруппаЗапрещенаРазрешенаОтгрузка, СвойстваЭлементовФормы.ИмяКартинки);
	УВМ_РаботаСФормами.НоваяКоманда(ЭтаФорма, "УВМ_ЗапрещенаРазрешенаОтгрузка", СвойстваЭлементовФормы.ЗаголовокКнопки, "УВМ_ЗапрещенаРазрешенаОтгрузка");
	УВМ_РаботаСФормами.НоваяКнопка(ЭтаФорма, "УВМ_ЗапрещенаРазрешенаОтгрузка", Элементы.УВМ_ГруппаЗапрещенаРазрешенаОтгрузка, СвойстваЭлементовФормы.ЗаголовокКнопки, "УВМ_ЗапрещенаРазрешенаОтгрузка", 2, СтруктураСвойствКнопки); 
	//--dar 13.11.25 (291567)
	
	//++dar 04.05.26 (326149)
	ГруппаСтр1 = УВМ_РаботаСФормами.НоваяГруппаОбычнаяБезОтображения(ЭтотОбъект, "ГруппаСтр1", Элементы.ГруппаРеквизиты, , 2); // 2 - Горизонтально
	УВМ_РаботаСФормами.НовоеПолеФлажок(ЭтотОбъект, "УВМ_Клиент",     ГруппаСтр1, Истина, "Клиент");
	УВМ_РаботаСФормами.НовоеПолеФлажок(ЭтотОбъект, "УВМ_Конкурент",  ГруппаСтр1, Истина, "Конкурент");
	УВМ_РаботаСФормами.НовоеПолеФлажок(ЭтотОбъект, "УВМ_Перевозчик", ГруппаСтр1, Истина, "Перевозчик");

	ГруппаСтр2 = УВМ_РаботаСФормами.НоваяГруппаОбычнаяБезОтображения(ЭтотОбъект, "ГруппаСтр2", Элементы.ГруппаРеквизиты, , 2);
	УВМ_РаботаСФормами.НовоеПолеФлажок(ЭтотОбъект, "УВМ_Поставщик", ГруппаСтр2, Истина, "Поставщик");
	УВМ_РаботаСФормами.НовоеПолеФлажок(ЭтотОбъект, "УВМ_ПрочиеОтношения",       ГруппаСтр2, Истина, "Прочие отношения");

	ГруппаСтр3 = УВМ_РаботаСФормами.НоваяГруппаОбычнаяБезОтображения(ЭтотОбъект, "ГруппаСтр3", Элементы.ГруппаРеквизиты, , 2);
	УВМ_РаботаСФормами.НовоеПолеФлажок(ЭтотОбъект, "УВМ_Хранитель_Арендодатель", ГруппаСтр3, Истина, "Хранитель/Арендодатель");
	УВМ_РаботаСФормами.НовоеПолеФлажок(ЭтотОбъект, "УВМ_Подрядчик", ГруппаСтр3, Истина, "Подрядчик");
	//--dar 04.05.26 (326149)
	
КонецПроцедуры

&НаКлиенте
Процедура УВМ_ЗапрещенаРазрешенаОтгрузка(Команда)
	
	//++ РомановНЕ 20240115 (161623)	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ТекстВопроса = Нстр("ru = 'Данные еще не записаны.
		|Переход к запрету отгрузки возможен только после записи данных.
		|Данные будут записаны.';
		|en = 'The data is not recorded. 
		|You can go to delivery block only after the data is recorded.
		|The data will be recorded.'");
		
		Возврат;
		
	КонецЕсли;
	
	
	ПараметрыФормыЗапретаОтгрузки = Новый Структура;
	ПараметрыФормыЗапретаОтгрузки.Вставить("Контрагент", Объект.Ссылка);
	
	ОткрытьФорму("Справочник.Контрагенты.Форма.УВМ_ФормаЗапретаОтгрузки", ПараметрыФормыЗапретаОтгрузки);
	//-- РомановНЕ 20240115 (161623)
	
КонецПроцедуры
